class NewsData {
  final List<NewsDatacon> menuItems = [
    NewsDatacon(
        'โรคเบาหวาน ไม่หวานนะ',
        'ปัจจุบันเราพบว่า ผู้คนเป็นโรคเบาหวานกันมากขึ้นในช่วงอายุที่น้อยลง โรคเบาหวานเป็นโรคที่คุกคามต่อสุขภาพและชีวิต ทั้งยังต้องเสียค่าใช้จ่ายในการรักษาสูง เนื่องจากเป็นโรคเรื้อรังที่ไม่ใช่แค่เพียงแต่มีระดับน้ำตาลในเลือดสูงกว่าปกติ หรือมีน้ำตาลในปัสสาวะเท่านั้น แต่เป็นโรคที่สามารถทำให้เกิดความเสื่อมของอวัยวะต่างๆ ในร่างกาย ซึ่งจะนำไปสู่ภาวะแทรกซ้อนอันมีผลกระทบต่อคุณภาพชีวิตอย่างมาก',
        'https://static.thairath.co.th/media/HCtHFA7ele6Q2dUNFcvcbHMoIzFza5qgJ7HQUBskynmvXMapTcplbeV99PU3SpUsCA.webplink',
        'อาหารขัดสี',
        'นายแพทย์สุวรรณชัย วัฒนายิ่งเจริญชัย อธิบดีกรมอนามัย กล่าวว่า ข้าว แป้ง และผลิตภัณฑ์ที่ผ่านกระบวนการขัดสี จะมีใยอาหารน้อยแต่น้ำตาลสูง สามารถย่อยและทำให้ระดับน้ำตาลในเลือดเพิ่มขึ้นเร็ว ส่งผลต่อประสิทธิภาพการทำงานของอวัยวะให้ทำงานน้อยลง จนเกิดโรคแทรกซ้อนในผู้ป่วยเบาหวาน และอาจนำไปสู่การเสียชีวิตได้',
        'https://thainews.prd.go.th/assets/public_images/defaultpic.png?=vqb2mbWQxWWpOTFdJOTE-'),
    NewsDatacon(
        'โภชนาการของคนเป็นเบาหวาน',
        '“โรคเบาหวาน” เกิดจากการที่ตับอ่อนมีความผิดปกติในการสร้างอินซูลิน หรือไม่สามารถสร้างอินซูลินได้ หรือร่างกายไม่สามารถตอบสนองกับอินซูลินได้ดี ส่งผลให้ไม่สามารถนำน้ำตาลไปเปลี่ยนเป็นพลังงานให้ร่างกายได้ ระดับน้ำตาลในเลือดจึงสูงกว่าปกติ',
        'https://static.thairath.co.th/media/dFQROr7oWzulq5Fa5yTmT3RQIYiMsM96RAWoR2DExnpdZXOAOFTZFx5fu6RFaO0tal5.webp',
        'อาหารผู้ป่วยไต',
        'รู้หรือไม่ว่า คนไทยป่วยเป็น "โรคไตเรื้อรัง" มากกว่า 8 ล้านคน เนื่องจากพฤติกรรมการกินฟาสต์ฟู้ด ขนมขบเคี้ยว และอาหารประเภทเนื้อสัตว์หมักซอสและน้ำจิ้มต่างๆ ซึ่งถือเป็นภัยสุขภาพใกล้ตัวที่ไม่ควรมองข้าม เนื่องจาก "ไต" เป็นอวัยวะสำคัญของร่างกาย ที่ทำหน้าที่ช่วยกำจัดของเสีย และช่วยความสมดุลของเกลือแร่และน้ำภายในร่างกาย ผู้ที่ประสิทธิภาพของไตทำงานลดลง ก็อาจเกิดโรคไตลักษณะต่างๆ ตามมาได้ เช่น โรคไตเรื้อรัง, โรคไตวาย, โรคไตวายเฉียบพลัน เป็นต้น',
        'https://static.thairath.co.th/media/dFQROr7oWzulq5Fa5naShCfdR63nrwp5qBaFPQwCdDOP2gsfo9A7egzyiC6yRV08HR0.webp'),
    NewsDatacon(
        'โรคไต คุกคามคนไทย',
        'โรคไต เป็นปัญหาสภาวะสุขภาพที่กำลังคุกคามคนไทยที่มีอัตราการเพิ่มขึ้นของผู้ป่วยแบบก้าวกระโดด จาก 8 ล้านคนในปี 63 เพิ่มเป็น 11.6 ล้านคนในปี 65 และจำนวนผู้ที่ล้างไตเพิ่มจาก 80,000 คน เป็น 1 แสนคนสาเหตุสำคัญที่ทำให้จำนวนผู้ป่วยโรคไตเพิ่มขึ้นอย่างรวดเร็ว ส่วนหนึ่งมาจากพฤติกรรมการบริโภค โดยพบว่า คนไทยบริโภคโซเดียมมากถึง 3,635 มิลลิกรัมต่อวันหรือเทียบเท่า เกลือประมาณ 2 ช้อนชา สูงกว่าปริมาณที่ควรจะเป็นหรือที่ไม่ทำร้ายสุขภาพร่างกายถึง 2 เท่า',
        'https://static.thairath.co.th/media/dFQROr7oWzulq5Fa5yMqv49aLDIXCH3hGvcziHFyVTDeDgcisthnUn0K4OoAvAOCljA.webp',
        '"แตงโมต้มน้ำตาล" รักษาโรคไตไม่ได้',
        'กระทรวงสาธารณสุข เผยการนำ "แตงโมต้มน้ำตาล" มากินเพื่อรักษาโรคไต ไม่ใช่เรื่องจริง หากกินเยอะเกินไป เสี่ยงเป็นโรคอ้วน เบาหวาน และฟันผุได้ แนะควบคุมอาหารให้เหมาะกับร่างกายนายแพทย์สุวรรณชัย วัฒนายิ่งเจริญชัย อธิบดีกรมอนามัย เปิดเผยว่า จากกระแสข่าวที่แชร์กันอยู่ใน สื่อออนไลน์ ประเด็นการต้มแตงโมไฟอ่อนผสมน้ำตาล และปั่นทิ้งไว้ 4-5 วัน จะได้น้ำเหนียวๆ เรียกว่า น้ำตาลแตงโมกินครั้งละ 1 ช้อนโต๊ะ วันละ 2 ครั้ง เช้า - เย็น จะช่วยรักษาโรคไตได้ ซึ่งคำแนะนำในเรื่องนี้ไม่เป็นความจริงแต่อย่างใด',
        'https://static.thairath.co.th/media/dFQROr7oWzulq5Fa4vFvhoZMdZccHuCEZhiUHKWA4M8FHt3NZ9tt2EDzhnEqirulaAv.webp')
  ];
}

class NewsDatacon {
  String name;
  String data;
  String link;
  String name2;
  String data2;
  String link2;

  NewsDatacon(
      this.name, this.data, this.link, this.name2, this.data2, this.link2);
}
